app/controllers/files_controller.rb

  def show
    @file = UserFile.find(params[:id])
---
SELECT  "user_files".* FROM "user_files" WHERE "user_files"."id" = ? LIMIT 1  [["id", 3]]

  def index
    @files = User.find(params[:user_id]).user_files.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "user_files".* FROM "user_files" WHERE "user_files"."user_id" = ?  [["user_id", 1]]

  def create
    @user = User.find(params[:user_id])
    if @file = @user.user_files.create(file_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "user_files" ("file", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["file", "cars_tuning_sports_nissan_skyline_r34_gt_r_jdm_1600x900_12514.jpg"], ["user_id", 1], ["created_at", "2016-03-25 12:44:58.216440"], ["updated_at", "2016-03-25 12:44:58.216440"]]

  def destroy
    @user = User.find(params[:user_id])
    @user.user_files.find(params[:id]).remove_file!
    @user.user_files.find(params[:id]).destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "user_files".* FROM "user_files" WHERE "user_files"."user_id" = ? AND "user_files"."id" = ? LIMIT 1  [["user_id", 1], ["id", 3]]
DELETE FROM "user_files" WHERE "user_files"."id" = ?  [["id", 3]]